Repository: gnachman/iTerm2
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# Codecierge.DangerWarningBody
source: This lets an AI completely control your computer. It could delete your files, do something stupid or dangerous, or lead to the downfall of humanity. Proceed with caution.
de: Dadurch kann eine KI Ihren Computer vollständig steuern. Sie könnte Ihre Dateien löschen, etwas Dummes oder Gefährliches tun oder zum Untergang der Menschheit führen. Gehen Sie mit Vorsicht vor.
ja: これにより、AIがあなたのコンピュータを完全に制御できるようになります。ファイルを削除したり、愚かで危険なことをしたり、人類の滅亡につながったりする可能性があります。十分に注意して進めてください。
pt_br: Isso permite que uma IA controle completamente o seu computador. Ela pode apagar seus arquivos, fazer algo estúpido ou perigoso, ou levar à ruína da humanidade. Prossiga com cautela.
ru: Это позволяет ИИ полностью управлять вашим компьютером. Он может удалить ваши файлы, сделать что-то глупое или опасное или привести к гибели человечества. Действуйте осторожно.
zh_hans: 这将让 AI 完全控制你的电脑。它可能会删除你的文件、做出愚蠢或危险的事情，甚至导致人类走向灭亡。请谨慎操作。

# Codecierge.DangerWarningHeading
source: Danger!
de: Gefahr!
ja: 危険！
pt_br: Perigo!
ru: Опасность!
zh_hans: 危险！

# Codecierge.EndTask
source: End Task
de: Aufgabe beenden
ja: タスクを終了
pt_br: Encerrar tarefa
ru: Завершить задачу
zh_hans: 结束任务

# Codecierge.GenericError
source: There was an error: %@
de: Es ist ein Fehler aufgetreten: %@
ja: エラーが発生しました: %@
pt_br: Ocorreu um erro: %@
ru: Произошла ошибка: %@
zh_hans: 发生错误：%@

# Codecierge.GetStarted
source: Get Started
de: Loslegen
ja: 開始する
pt_br: Começar
ru: Начать
zh_hans: 开始使用

# Codecierge.GoalPlaceholder
source: I want to…
de: Ich möchte…
ja: したいこと…
pt_br: Quero…
ru: Я хочу…
zh_hans: 我想要…

# Codecierge.GoalPrefix
source: Goal:
de: Ziel:
ja: 目標:
pt_br: Objetivo:
ru: Цель:
zh_hans: 目标：

# Codecierge.GoalPrompt
source: What are you trying to do? I'll suggest commands and explain their output.
de: Was möchten Sie tun? Ich schlage Befehle vor und erkläre ihre Ausgabe.
ja: 何をしようとしていますか？コマンドを提案し、その出力を説明します。
pt_br: O que você está tentando fazer? Vou sugerir comandos e explicar sua saída.
ru: Что вы пытаетесь сделать? Я предложу команды и объясню их вывод.
zh_hans: 你想做什么？我会建议命令并解释其输出。

# Codecierge.KeepGoing
source: Keep Going
de: Weiter
ja: 続行
pt_br: Continuar
ru: Продолжить
zh_hans: 继续

# Codecierge.LongSessionBody
source: Your codecierge session has been going on for a long time. Are you still using it? If not, stop it to save money and privacy.
de: Ihre Codecierge-Sitzung läuft schon seit langer Zeit. Nutzen Sie sie noch? Falls nicht, beenden Sie sie, um Kosten zu sparen und Ihre Privatsphäre zu schützen.
ja: Codeciergeのセッションが長時間続いています。まだ使用していますか？使用していない場合は、費用とプライバシーを守るために停止してください。
pt_br: Sua sessão do codecierge está durando muito tempo. Você ainda está usando? Se não, pare-a para economizar dinheiro e preservar a privacidade.
ru: Ваш сеанс Codecierge длится уже долго. Вы всё ещё им пользуетесь? Если нет, остановите его, чтобы сэкономить деньги и защитить конфиденциальность.
zh_hans: 你的 codecierge 会话已持续很长时间。你还在使用它吗？如果没有，请停止它，以节省费用并保护隐私。

# Codecierge.LongSessionHeading
source: Codecierge Usage Warning
de: Codecierge-Nutzungswarnung
ja: Codeciergeの使用に関する警告
pt_br: Aviso de uso do Concierge de código
ru: Предупреждение об использовании Codecierge
zh_hans: Codecierge 使用警告

# Codecierge.MustEnableAI
source: You must enable AI features to use Codecierge.
de: Sie müssen die KI-Funktionen aktivieren, um Codecierge zu verwenden.
ja: Codeciergeを使用するにはAI機能を有効にする必要があります。
pt_br: Você precisa ativar os recursos de IA para usar o Concierge de código.
ru: Чтобы использовать Codecierge, необходимо включить функции ИИ.
zh_hans: 你必须启用 AI 功能才能使用 Codecierge。

# Codecierge.OnboardingLabel
source: Codecierge uses AI to help you in your terminal.
de: Codecierge verwendet KI, um Ihnen in Ihrem Terminal zu helfen.
ja: CodeciergeはAIを使ってターミナル操作をサポートします。
pt_br: O Concierge de código usa IA para ajudar você no seu terminal.
ru: Codecierge использует ИИ, чтобы помогать вам в терминале.
zh_hans: Codecierge 使用 AI 在你的终端中帮助你。

# Codecierge.PrivacyWarningBody
source: Everything that happens in your terminal while Codecierge is running will be sent to your AI provider. Don't send them confidential information!
de: Alles, was in Ihrem Terminal geschieht, während Codecierge läuft, wird an Ihren KI-Anbieter gesendet. Senden Sie ihm keine vertraulichen Informationen!
ja: Codeciergeの実行中にターミナルで起きたことはすべてAIプロバイダーに送信されます。機密情報を送信しないでください！
pt_br: Tudo o que acontece no seu terminal enquanto o Concierge de código está em execução será enviado ao seu provedor de IA. Não envie informações confidenciais a ele!
ru: Всё, что происходит в терминале во время работы Codecierge, будет отправлено вашему провайдеру ИИ. Не отправляйте им конфиденциальную информацию!
zh_hans: 在 Codecierge 运行时，终端中发生的所有内容都将发送到您的 AI 提供商。请勿发送机密信息！

# Codecierge.PrivacyWarningHeading
source: Privacy Warning
de: Datenschutzwarnung
ja: プライバシーに関する警告
pt_br: Aviso de privacidade
ru: Предупреждение о конфиденциальности
zh_hans: 隐私警告

# Codecierge.ResponsePlaceholder
source: Response
de: Antwort
ja: 返信
pt_br: Resposta
ru: Ответ
zh_hans: 响应

# Codecierge.RevealSetting
source: Reveal Setting
de: Einstellung anzeigen
ja: 設定を表示
pt_br: Mostrar ajuste
ru: Показать настройку
zh_hans: 显示设置

# Codecierge.RunCommandsAutomatically
source: Run commands automatically
de: Befehle automatisch ausführen
ja: コマンドを自動的に実行する
pt_br: Executar comandos automaticamente
ru: Запускать команды автоматически
zh_hans: 自动运行命令

# Codecierge.RunningCommand
source: Running `%@`
de: Führe `%@` aus
ja: `%@` を実行中
pt_br: Executando `%@`
ru: Выполняется `%@`
zh_hans: 正在运行 `%@`

# Codecierge.SendReplyAccessibility
source: Send reply
de: Antwort senden
ja: 返信を送信
pt_br: Enviar resposta
ru: Отправить ответ
zh_hans: 发送回复

# Codecierge.Start
source: Start
de: Starten
ja: 開始
pt_br: Iniciar
ru: Начать
zh_hans: 开始

# Codecierge.StopCodecierge
source: Stop Codecierge
de: Codecierge beenden
ja: Codeciergeを停止
pt_br: Parar o Concierge de código
ru: Остановить Codecierge
zh_hans: 停止 Codecierge

# Codecierge.Thinking
source: Thinking…
de: Denkt nach…
ja: 考え中…
pt_br: Pensando…
ru: Обдумывание…
zh_hans: 思考中…

# Codecierge.WritingTo
source: Writing to %@
de: Schreibe in %@
ja: %@ に書き込み中
pt_br: Gravando em %@
ru: Запись в %@
zh_hans: 正在写入 %@

# Codecierge.YouSection
source: ### 👤 You %@
de: ### 👤 Sie %@
ja: ### 👤 あなた %@
pt_br: ### 👤 Você %@
ru: ### 👤 Вы %@
zh_hans: ### 👤 你 %@

# CodeReviewPrompt.ManageMenuItem
source: Manage Prompts…
de: Prompts verwalten…
ja: プロンプトを管理…
pt_br: Gerenciar prompts…
ru: Управление промптами…
zh_hans: 管理提示…

# CodeReviewPrompt.SaveAsNewMenuItem
source: Save Current as New…
de: Aktuelles als neu speichern…
ja: 現在の内容を新規として保存…
pt_br: Salvar atual como novo…
ru: Сохранить текущий как новый…
zh_hans: 存储为…

# CodeReviewPrompt.SaveInformative
source: Saved prompts can be re-loaded from the Prompts pulldown.
de: Gespeicherte Prompts können über das Prompts-Menü erneut geladen werden.
ja: 保存したプロンプトは、プロンプトのプルダウンから再度読み込めます。
pt_br: Os prompts salvos podem ser recarregados no menu suspenso Prompts.
ru: Сохранённые промпты можно снова загрузить из выпадающего списка «Промпты».
zh_hans: 已保存的提示可以从“提示”下拉菜单中重新加载。

# CodeReviewPrompt.SaveTitle
source: Name this prompt
de: Diesen Prompt benennen
ja: このプロンプトの名前を付ける
pt_br: Dê um nome a este prompt
ru: Назовите этот промпт
zh_hans: 为此提示命名

# CodeReviewPrompt.StartButton
source: Start
de: Starten
ja: 開始
pt_br: Iniciar
ru: Начать
zh_hans: 开始

# CodeReviewPromptManager.EmptyPlaceholder
source: Select a prompt on the left to edit it, or click + to add a new prompt.
de: Wählen Sie links einen Prompt aus, um ihn zu bearbeiten, oder klicken Sie auf +, um einen neuen Prompt hinzuzufügen.
ja: 編集するには左側でプロンプトを選択するか、+ をクリックして新しいプロンプトを追加してください。
pt_br: Selecione um prompt à esquerda para editá-lo, ou clique em + para adicionar um novo prompt.
ru: Выберите промпт слева, чтобы отредактировать его, или нажмите +, чтобы добавить новый промпт.
zh_hans: 在左侧选择提示词进行编辑，或点击 + 添加新提示词。

# CodeReviewPromptManager.NamePlaceholder
source: Untitled
de: Unbenannt
ja: 無題
pt_br: Sem título
ru: Без названия
zh_hans: 未命名

# CodeReviewPromptManager.NewPromptName
source: New Prompt
de: Neuer Prompt
ja: 新規プロンプト
pt_br: Novo prompt
ru: Новый промпт
zh_hans: 新提示词

# ColorAlpha.MissingArguments
source: with_alpha requires a color string and a numeric alpha
de: with_alpha erfordert eine Farbzeichenfolge und einen numerischen Alpha-Wert
ja: with_alphaには色を表す文字列と数値のアルファ値が必要です
pt_br: with_alpha requer uma string de cor e um alfa numérico
ru: with_alpha требует строку цвета и числовое значение alpha
zh_hans: with_alpha 需要颜色字符串和数字透明度值

# ColorAlpha.ParseFailed
source: with_alpha could not parse color “%@”
de: with_alpha konnte die Farbe „%@“ nicht analysieren
ja: with_alphaは色「%@」を解析できませんでした
pt_br: with_alpha não conseguiu analisar a cor “%@”
ru: with_alpha не удалось разобрать цвет «%@»
zh_hans: with_alpha 无法解析颜色“%@”

# ColorPreset.ImportedMessage
source: The color scheme was imported and added to presets. You can find it under Settings > Profiles > Colors > Load Presets….
de: Das Farbschema wurde importiert und zu den Voreinstellungen hinzugefügt. Sie finden es unter Einstellungen > Profile > Farben > Voreinstellungen laden….
ja: カラースキームがインポートされ、プリセットに追加されました。「設定」＞「プロファイル」＞「カラー」＞「プリセットを読み込む…」から確認できます。
pt_br: O esquema de cores foi importado e adicionado às predefinições. Você pode encontrá-lo em Ajustes > Perfis > Cores > Carregar predefinições….
ru: Цветовая схема импортирована и добавлена в пресеты. Её можно найти в разделе Настройки > Профили > Цвета > Загрузить пресеты….
zh_hans: 已导入该颜色方案并添加到预设中。你可以在“设置 > 配置文件 > 颜色 > 载入预设…”下找到它。

# ColorPreset.ImportedTitle
source: Colors Scheme Imported
de: Farbschema importiert
ja: カラースキームをインポートしました
pt_br: Esquema de cores importado
ru: Цветовая схема импортирована
zh_hans: 已导入颜色方案

# ColorPresets.AddItAnyway
source: Add it anyway
de: Trotzdem hinzufügen
ja: それでも追加
pt_br: Adicionar mesmo assim
ru: Всё равно добавить
zh_hans: 仍然添加

# ColorPresets.DuplicateInformative
source: The color preset “%@” is the same as the preset you're trying to add. Really add it?
de: Die Farbvoreinstellung „%@“ entspricht der Voreinstellung, die Sie hinzufügen möchten. Möchten Sie sie wirklich hinzufügen?
ja: カラープリセット「%@」は追加しようとしているプリセットと同じです。本当に追加しますか？
pt_br: A predefinição de cor “%@” é igual à predefinição que você está tentando adicionar. Deseja mesmo adicioná-la?
ru: Пресет цвета «%@» совпадает с тем, который вы пытаетесь добавить. Действительно добавить его?
zh_hans: 颜色预设“%@”与你尝试添加的预设相同。确定要添加吗？

# ColorPresets.DuplicateTitle
source: Add duplicate color preset?
de: Doppelte Farbvoreinstellung hinzufügen?
ja: 重複するカラープリセットを追加しますか？
pt_br: Adicionar predefinição de cor duplicada?
ru: Добавить повторяющийся пресет цвета?
zh_hans: 添加重复的颜色预设？

# ColorPresets.ImportFailedInformative
source: The selected file could not be read or did not contain a valid color scheme.
de: Die ausgewählte Datei konnte nicht gelesen werden oder enthielt kein gültiges Farbschema.
ja: 選択したファイルを読み込めなかったか、有効なカラースキームが含まれていませんでした。
pt_br: Não foi possível ler o arquivo selecionado, ou ele não continha um esquema de cores válido.
ru: Не удалось прочитать выбранный файл, либо он не содержит корректную цветовую схему.
zh_hans: 无法读取所选文件，或所选文件不包含有效的颜色方案。

# ColorPresets.ImportFailedTitle
source: Import Failed.
de: Import fehlgeschlagen.
ja: インポートに失敗しました。
pt_br: Falha na importação.
ru: Ошибка импорта.
zh_hans: 导入失败。

# CommandExplainer.OpenConfirmationHeading
source: Open ExplainShell?
de: ExplainShell öffnen?
ja: ExplainShellを開きますか？
pt_br: Abrir o ExplainShell?
ru: Открыть ExplainShell?
zh_hans: 打开 ExplainShell？

# CommandExplainer.OpenConfirmationMessage
source: This will open %1$@ in %2$@.
de: Dadurch wird %1$@ in %2$@ geöffnet.
ja: %1$@ を %2$@ で開きます。
pt_br: Isso abrirá %1$@ em %2$@.
ru: Это откроет %1$@ в %2$@.
zh_hans: 这将在 %2$@ 中打开 %1$@。

# CommandInfo.AddCommandAsSnippet
source: Add Command as Snippet
de: Befehl als Snippet hinzufügen
ja: コマンドをスニペットとして追加
pt_br: Adicionar comando como fragmento
ru: Добавить команду как сниппет
zh_hans: 将命令添加为代码片段

# CommandInfo.CopyCommandURL
source: Copy Command URL to Clipboard
de: Befehls-URL in die Zwischenablage kopieren
ja: コマンドのURLをクリップボードにコピー
pt_br: Copiar URL do comando para a área de transferência
ru: Скопировать URL команды в буфер обмена
zh_hans: 将命令 URL 拷贝到剪贴板

# CommandInfo.DateOnDate
source: %1$@ on %2$@
de: %1$@ am %2$@
pt_br: %1$@ em %2$@
zh_hans: %1$@ 位于 %2$@ 中

# CommandInfo.LineCount
source: (%lld lines)
de: (%lld Zeilen)
ja: （%lld行）
pt_br: (%lld linhas)
ru: (%lld строки)
zh_hans: （%lld 行）

# CommandInfo.OpenShareSheet
source: Open Share Sheet…
de: Freigabemenü öffnen…
ja: 共有シートを開く…
pt_br: Abrir painel de compartilhamento…
ru: Открыть окно «Поделиться»…
zh_hans: 打开共享面板…

# CommandInfo.SnippetAdded
source: Snippet Added
de: Snippet hinzugefügt
ja: スニペットを追加しました
pt_br: Fragmento adicionado
ru: Сниппет добавлен
zh_hans: 已添加代码片段

# CommandInfo.StartedAtPrefix
source: Started at
de: Gestartet um
ja: 開始:
pt_br: Iniciado em
ru: Начато в
zh_hans: 开始于

# CommandInfo.StillRunning
source: Still Running
de: Läuft noch
ja: 実行中
pt_br: Ainda em execução
ru: Всё ещё выполняется
zh_hans: 仍在运行

# CommandInfo.Unknown
source: Unknown
de: Unbekannt
ja: 不明
pt_br: Desconhecido
ru: Неизвестно
zh_hans: 未知

# CommandRunner.CommandFailedHeading
source: Command Failed
de: Befehl fehlgeschlagen
ja: コマンドが失敗しました
pt_br: Falha no comando
ru: Команда завершилась с ошибкой
zh_hans: 命令失败

# CommandRunner.CommandFailedTitle
source: The following command returned a non-zero exit code: “%1$@ %2$@”
de: Der folgende Befehl gab einen Exit-Code ungleich null zurück: „%1$@ %2$@“
ja: 次のコマンドがゼロ以外の終了コードを返しました: 「%1$@ %2$@」
pt_br: O comando a seguir retornou um código de saída diferente de zero: “%1$@ %2$@”
ru: Следующая команда вернула ненулевой код выхода: «%1$@ %2$@»
zh_hans: 以下命令返回了非零退出码： “%1$@ %2$@”

# CommandRunner.OutputTruncatedLabel
source: [output truncated]
de: [Ausgabe gekürzt]
ja: [出力は切り詰められました]
pt_br: [saída truncada]
ru: [вывод обрезан]
zh_hans: [输出被截断]

# CommandRunner.View
source: View
de: Anzeigen
ja: 表示
pt_br: Visualizar
ru: Просмотреть
zh_hans: 查看

# CommandShare.AddCommandAsSnippet
source: Add Command as Snippet
de: Befehl als Snippet hinzufügen
ja: コマンドをスニペットとして追加
pt_br: Adicionar comando como fragmento
ru: Добавить команду как сниппет
zh_hans: 将命令添加为代码片段

# CommandShare.CopiedToast
source: Copied
de: Kopiert
ja: コピーしました
pt_br: Copiado
ru: Скопировано
zh_hans: 已拷贝

# CommandShare.CopyCommandURL
source: Copy Command URL to Clipboard
de: Befehls-URL in die Zwischenablage kopieren
ja: コマンドのURLをクリップボードにコピー
pt_br: Copiar URL do comando para a área de transferência
ru: Скопировать URL команды в буфер обмена
zh_hans: 将命令 URL 拷贝到剪贴板

# CommandShare.DefaultCommandName
source: iTerm2 Command
de: iTerm2-Befehl
ja: iTerm2コマンド
pt_br: Comando do iTerm2
ru: Команда iTerm2
zh_hans: iTerm2 命令

# CommandShare.SaveCommandAndOutput
source: Save Command & Output…
de: Befehl & Ausgabe speichern…
ja: コマンドと出力を保存…
pt_br: Salvar comando e saída…
ru: Сохранить команду и вывод…
zh_hans: 存储命令与输出…

# CommandShare.ShareCommandOutput
source: Share Command Output…
de: Befehlsausgabe teilen…
ja: コマンドの出力を共有…
pt_br: Compartilhar saída do comando…
ru: Поделиться выводом команды…
zh_hans: 共享命令输出…

# CommandShare.ShareCommandURL
source: Share Command URL…
de: Befehls-URL teilen…
ja: コマンドのURLを共有…
pt_br: Compartilhar URL do comando…
ru: Поделиться URL команды…
zh_hans: 共享命令 URL…

# CommandShare.SnippetAddedToast
source: Snippet Added
de: Snippet hinzugefügt
ja: スニペットを追加しました
pt_br: Fragmento adicionado
ru: Сниппет добавлен
zh_hans: 已添加代码片段

# CommandURL.AsUser
source: as %@
de: als %@
ja: %@ として
pt_br: como %@
ru: от имени %@
zh_hans: 以 %@ 身份

# CommandURL.CommandLabel
source: Command:
de: Befehl:
ja: コマンド:
pt_br: Comando:
ru: Команда:
zh_hans: 命令：

# CommandURL.DirectoryLabel
source: Directory:
de: Verzeichnis:
ja: ディレクトリ:
pt_br: Diretório:
ru: Каталог:
zh_hans: 目录：

# CommandURL.DirectoryPlaceholder
source: Directory
de: Verzeichnis
ja: ディレクトリ
pt_br: Diretório
ru: Каталог
zh_hans: 目录

# CommandURL.OnHost
source: on %@
de: auf %@
ja: %@ 上で
pt_br: em %@
ru: на %@
zh_hans: 在 %@ 上

# CommandURL.OpenInTabOffered
source: Open in tab offered
de: In Tab öffnen angeboten
ja: タブで開くオプションが利用可能
pt_br: Abrir em aba disponível
ru: Открытие во вкладке предложено
zh_hans: 在提供的标签页中打开

# CommandURL.RunAsUser
source: Run as %@
de: Als %@ ausführen
ja: %@ として実行
pt_br: Executar como %@
ru: Запустить от имени %@
zh_hans: 以 %@ 模式运行

# CommandURL.RunCommandHeading
source: Run Command?
de: Befehl ausführen?
ja: コマンドを実行しますか？
pt_br: Executar comando?
ru: Запустить команду?
zh_hans: 运行命令？

# CommandURL.RunCommandPrefix
source: Run command
de: Befehl ausführen
ja: コマンドを実行
pt_br: Executar comando
ru: Запустить команду
zh_hans: 运行命令

# CommandURL.RunInCurrentOffered
source: Run in current session offered
de: In aktueller Sitzung ausführen angeboten
ja: 現在のセッションで実行するオプションが利用可能
pt_br: Executar na sessão atual disponível
ru: Запуск в текущей сессии предложен
zh_hans: 在当前会话中运行（提供）

# CommandURL.RunInCurrentSession
source: Run in Current Session
de: In aktueller Sitzung ausführen
ja: 現在のセッションで実行
pt_br: Executar na sessão atual
ru: Запустить в текущей сессии
zh_hans: 在当前会话中运行

# CommandURL.RunInDirectory
source: Run in directory %@
de: Im Verzeichnis %@ ausführen
ja: ディレクトリ %@ で実行
pt_br: Executar no diretório %@
ru: Запустить в каталоге %@
zh_hans: 在目录 %@ 中运行

# CommandURL.RunInNewTab
source: Run in New Tab
de: In neuem Tab ausführen
ja: 新規タブで実行
pt_br: Executar em nova aba
ru: Запустить в новой вкладке
zh_hans: 在新标签页中运行

# CommandURL.RunInNewWindow
source: Run in New Window
de: In neuem Fenster ausführen
ja: 新規ウィンドウで実行
pt_br: Executar em nova janela
ru: Запустить в новом окне
zh_hans: 在新窗口中运行

# CommandURL.RunOnHostToggle
source: Run on %@ via ssh
de: Auf %@ über SSH ausführen
ja: sshで %@ 上で実行
pt_br: Executar em %@ via ssh
ru: Запустить на %@ через ssh
zh_hans: 通过 ssh 在 %@ 上运行

# CommandURL.SilentConfirmSuffix
source: ? It will run silently in the background.
de: ? Er wird im Hintergrund lautlos ausgeführt.
ja: ？ バックグラウンドでサイレントに実行されます。
pt_br: ? Ele será executado silenciosamente em segundo plano.
ru: ? Она будет выполнена в фоновом режиме без вывода.
zh_hans: ? 它将在后台静默运行。

# CommandURL.UsernameLabel
source: Username:
de: Benutzername:
ja: ユーザー名:
pt_br: Nome de usuário:
ru: Имя пользователя:
zh_hans: 用户名：

# CommandURL.UsernamePlaceholder
source: Username
de: Benutzername
ja: ユーザー名
pt_br: Nome de usuário
ru: Имя пользователя
zh_hans: 用户名

# CommandURL.WindowTitle
source: Run Command from URL
de: Befehl aus URL ausführen
ja: URLからコマンドを実行
pt_br: Executar comando a partir de URL
ru: Запуск команды по URL
zh_hans: 从 URL 运行命令

# Companion.APIKeyLabel
source: API key:
de: API-Schlüssel:
ja: APIキー:
pt_br: Chave de API:
ru: Ключ API:
zh_hans: API 密钥：

# Companion.APIKeyPlaceholder
source: Paste your API key
de: Fügen Sie Ihren API-Schlüssel ein
ja: APIキーを貼り付け
pt_br: Cole sua chave de API
ru: Вставьте ваш ключ API
zh_hans: 粘贴您的 API 密钥

# Companion.BackButton
source: Back
de: Zurück
ja: 戻る
pt_br: Voltar
ru: Назад
zh_hans: 返回

# Companion.CloseButton
source: Close
de: Schließen
ja: 閉じる
pt_br: Fechar
ru: Закрыть
zh_hans: 关闭

# Companion.DeviceSettingsAXDescription
source: Companion Device Settings
de: Begleitgerät-Einstellungen
ja: コンパニオンデバイスの設定
pt_br: Ajustes do dispositivo Companion
ru: Настройки устройства-компаньона
zh_hans: Companion 设备设置

# Companion.GetAPIKeyButton
source: Get an API Key
de: Einen API-Schlüssel erhalten
ja: APIキーを取得
pt_br: Obter uma chave de API
ru: Получить ключ API
zh_hans: 获取 API 密钥

# Companion.InstallButton
source: Install
de: Installieren
ja: インストール
pt_br: Instalar
ru: Установить
zh_hans: 安装

# Companion.InstallExplanation.CompanionOnly
source: This installs the Companion plugin and turns on companion device pairing. Afterward, iTerm2 can send data off this Mac, but only with your explicit consent.
de: Dies installiert das Begleit-Plugin und aktiviert die Kopplung mit dem Begleitgerät. Danach kann iTerm2 Daten von diesem Mac senden, jedoch nur mit Ihrer ausdrücklichen Zustimmung.
ja: これによりCompanionプラグインがインストールされ、コンパニオンデバイスのペアリングが有効になります。以降、iTerm2はこのMacからデータを送信できるようになりますが、それはあなたの明示的な同意がある場合に限られます。
pt_br: Isto instala o plugin do Companion e ativa o pareamento com dispositivos companheiros. Depois disso, o iTerm2 pode enviar dados para fora deste Mac, mas somente com seu consentimento explícito.
ru: Это устанавливает плагин Компаньон и включает сопряжение с устройством-компаньоном. После этого iTerm2 сможет отправлять данные с этого Mac, но только с вашего явного согласия.
zh_hans: 此操作将安装 Companion 插件并开启伴侣设备配对功能。之后，iTerm2 可以在获得您明确同意的情况下将数据发送至此 Mac。

# Companion.InstallExplanation.Full
source: This installs the AI and Companion plugins and turns on both features. Afterward, iTerm2 can send data off this Mac, but only with your explicit consent.
de: Dies installiert die KI- und Begleit-Plugins und aktiviert beide Funktionen. Danach kann iTerm2 Daten von diesem Mac senden, jedoch nur mit Ihrer ausdrücklichen Zustimmung.
ja: これによりAIとCompanionの両プラグインがインストールされ、両方の機能が有効になります。以降、iTerm2はこのMacからデータを送信できるようになりますが、それはあなたの明示的な同意がある場合に限られます。
pt_br: Isto instala os plugins de IA e do Companion e ativa ambos os recursos. Depois disso, o iTerm2 pode enviar dados para fora deste Mac, mas somente com seu consentimento explícito.
ru: Это устанавливает плагины ИИ и Компаньон и включает обе функции. После этого iTerm2 сможет отправлять данные с этого Mac, но только с вашего явного согласия.
zh_hans: 窥视孔 (Porthole); tmux; macOS; iTerm2; API; URL; JSON; CLI; LLM; FPS; HDR; path; hostname.

# Companion.InstallTitle.CompanionOnly
source: Enable Companion Pairing
de: Kopplung mit dem Begleitgerät aktivieren
ja: コンパニオンのペアリングを有効化
pt_br: Ativar pareamento do Companion
ru: Включить сопряжение с Компаньоном
zh_hans: 启用 Companion 配对

# Companion.InstallTitle.Full
source: Set Up Your Companion Device
de: Begleitgerät einrichten
ja: コンパニオンデバイスをセットアップ
pt_br: Configurar seu dispositivo companheiro
ru: Настройка устройства-компаньона
zh_hans: 设置您的伴侣设备

# Companion.LearnMoreButton
source: Learn About the Companion App
de: Mehr über die Begleit-App erfahren
ja: コンパニオンアプリについて学ぶ
pt_br: Saiba mais sobre o app companheiro
ru: Подробнее о приложении Компаньон
zh_hans: 了解伴侣应用

# Companion.NextButton
source: Next
de: Weiter
ja: 次へ
pt_br: Avançar
ru: Далее
zh_hans: 下一步

# Companion.Paired.CheckmarkAccessibility
source: Companion device connection status
de: Verbindungsstatus des Begleitgeräts
ja: コンパニオンデバイスの接続状態
pt_br: Status da conexão do dispositivo companheiro
ru: Статус подключения устройства-компаньона
zh_hans: 伴侣设备连接状态

# Companion.Paired.Connected
source: Your companion device is paired and connected.
de: Ihr Begleitgerät ist gekoppelt und verbunden.
ja: コンパニオンデバイスはペアリングされ、接続されています。
pt_br: Seu dispositivo companheiro está pareado e conectado.
ru: Ваше устройство-компаньон сопряжено и подключено.
zh_hans: 您的伴侣设备已配对并连接。

# Companion.Paired.Reconnecting
source: Your companion device is paired but iTerm2 isn’t listening for it yet. Reconnecting…
de: Ihr Begleitgerät ist gekoppelt, aber iTerm2 wartet noch nicht auf eine Verbindung. Verbindung wird wiederhergestellt…
ja: コンパニオンデバイスはペアリングされていますが、iTerm2はまだそれを待ち受けていません。再接続中…
pt_br: Seu dispositivo companheiro está pareado, mas o iTerm2 ainda não está aguardando por ele. Reconectando…
ru: Ваше устройство-компаньон сопряжено, но iTerm2 пока не ожидает его подключения. Переподключение…
zh_hans: 您的伴侣设备已配对，但 iTerm2 尚未监听它。正在重新连接……

# Companion.Paired.Title
source: Companion Device Paired
de: Begleitgerät gekoppelt
ja: コンパニオンデバイスのペアリング完了
pt_br: Dispositivo companheiro pareado
ru: Устройство-компаньон сопряжено
zh_hans: Companion 设备已配对
